# CannotCopyIncompleteElement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyIncompleteElement Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't copy part of element
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyIncompleteElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyIncompleteElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyIncompleteElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace